//imports


public class Board
{
  //global vars
  String [] a0 = new String [11];
  String [] a1 = new String [11];
  String [] a2 = new String [11];
  String [] a3 = new String [11];
  String [] a4 = new String [11];
  String [] a5 = new String [11];
  String [] a6 = new String [11];
  String [] a7 = new String [11];
  String [] a8 = new String [11];
  String [] a9 = new String [11];
  String [] a10 = new String [11];
  String [] a11 = new String [11];
  String[][] b = new String[11][12];//[12Y][11X]
  public Board()
  {
    String[][] b = {a1,a2,a3,a4,a5,a6,a7,a8,a9,a10,a11};
    String [] a0 = {"  " ,"  " ,"  " ,"  " ,"  " ,"  " ,"  " ,"  " ,"  ","  " ,"  "};
    String [] a1 = {"A " ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊","🌊" ,"🌊"};
    String [] a2 = {"B " ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊","🌊" ,"🌊"};
    String [] a3 = {"C " ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊","🌊" ,"🌊"};
    String [] a4 = {"D " ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊","🌊" ,"🌊"};
    String [] a5 = {"E " ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊","🌊" ,"🌊"};
    String [] a6 = {"F " ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊","🌊" ,"🌊"};
    String [] a7 = {"G " ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊","🌊" ,"🌊"};
    String [] a8 = {"H " ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊","🌊" ,"🌊"};
    String [] a9 = {"I " ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊","🌊" ,"🌊"};
    String [] a10 = {"J " ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊" ,"🌊","🌊" ,"🌊"};
    String [] a11 = {"  " ,"1 " ,"2 " ,"3 " ,"4 " ,"5 " ,"6 " ,"7 " ,"8" ,"9 " ,"10 "};
  }
  /*public boolean addShip(int row, int col, int len, boolean horizontal)
  {
    
  }
  public String toString()
  {

  }
  */
}